[LockboxKey X2ItemTemplate]
FriendlyName="Lockbox Key"
FriendlyNamePlural="Lockbox Keys"
BriefSummary="Used to unlock mysterious lockboxes..."

[LockBox X2ItemTemplate]
FriendlyName="Lockbox"
FriendlyNamePlural="Lockboxes"
BriefSummary="A mysterious lockbox... Potentially containing useful stuff... Potentially..."

[UnlockLockbox X2TechTemplate]
DisplayName="Unlock Lockbox"
Summary="Our troops recovered a lockbox from the field, and there might be something useful in here..."
CodeName="MrRusty"
LongDescription="I am not sure where this could have come from, but its mildly intriguing. Who could have made this? R. Tygan."
UnlockedDescription="Treasure found!"

[TLMUpgrade_RapidFire X2WeaponUpgradeTemplate]
FriendlyName="Rapid Fire Upgrade"
FriendlyNamePlural="Rapid Fire Upgrades"
BriefSummary="Gain <font color='#3ABD23'><Ability:RapidFireCharges/></font> charges of Rapid Fire ability. Each shot suffers an Aim penalty of <font color='#CA7200'><Ability:RapidFireAimPenalty/></font>. <font color='#3ABD23'><Ability:RapidFireCooldown/></font>-turn cooldown."
TinySummary="+Rapid Fire"

[TLMUpgrade_HailOfBullets X2WeaponUpgradeTemplate]
FriendlyName="Hail of Bullets Upgrade"
FriendlyNamePlural="Hail of Bullets Upgrades"
BriefSummary="Gain <font color='#3ABD23'><Ability:HailOfBulletsCharges/></font> charges of Hail of Bullets ability. Unleash a hail of bullets that is guaranteed to hit your target, but uses a lot of ammunition. <font color='#3ABD23'><Ability:HailOfBulletsCooldown/></font>-turn cooldown."
TinySummary="+Hail of Bullets"

[TLMUpgrade_KillZone X2WeaponUpgradeTemplate]
FriendlyName="Kill Zone Upgrade"
FriendlyNamePlural="Kill Zone Upgrades"
BriefSummary="Gain <font color='#3ABD23'><Ability:KillZoneCharges/></font> charges of Kill Zone ability. Take a reaction shot against any enemy that moves or attacks within a cone of fire. <font color='#3ABD23'><Ability:KillZoneCooldown/></font>-turn cooldown."
TinySummary="+Kill Zone"

[TLMUpgrade_Faceoff X2WeaponUpgradeTemplate]
FriendlyName="Faceoff Upgrade"
FriendlyNamePlural="Faceoff Upgrades"
BriefSummary="Gain <font color='#3ABD23'><Ability:FaceoffCharges/></font> charges of Faceoff ability. Fire once at every visible enemy with your pistol. <font color='#3ABD23'><Ability:FaceoffCooldown/></font>-turn cooldown."
TinySummary="+Faceoff"

[TLMUpgrade_AdventSoldierKiller X2WeaponUpgradeTemplate]
FriendlyName="Advent Killer Upgrade"
FriendlyNamePlural="Advent Killer Upgrades"
BriefSummary="This weapon echoes the death of millions killed by the Advent occupation. +<font color='#3ABD23'><Ability:BonusDamageAdventSoldier/></font> damage to Advent soldiers."
TinySummary="+Advent Killer"

[TLMUpgrade_Damage X2WeaponUpgradeTemplate]
FriendlyName="Weapon Refinement"
FriendlyNamePlural="Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMDAMAGE</font> Damage)."
TinySummary="+Damage"

[TLMUpgrade_Crit X2WeaponUpgradeTemplate]
FriendlyName="Weapon Refinement"
FriendlyNamePlural="Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMCRITDAMAGE</font> Crit Damage)."
TinySummary="+Crit Damage"

[TLMUpgrade_Pierce X2WeaponUpgradeTemplate]
FriendlyName="Weapon Refinement"
FriendlyNamePlural="Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMPIERCE</font> Pierce)."
TinySummary="+Pierce"

[TLMUpgrade_Shred X2WeaponUpgradeTemplate]
FriendlyName="Weapon Refinement"
FriendlyNamePlural="Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMSHRED</font> Shred)."
TinySummary="+Shred"

[TLMUpgrade_DamageMPierce X2WeaponUpgradeTemplate]
FriendlyName="Advanced Weapon Refinement"
FriendlyNamePlural="Advanced Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMDAMAGE</font> Damage, <font color='#CA7200'>-%TLMPIERCE</font> Pierce)."
TinySummary="+Damage, -Pierce"

[TLMUpgrade_CritMDamage X2WeaponUpgradeTemplate]
FriendlyName="Advanced Weapon Refinement"
FriendlyNamePlural="Advanced Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMCRITDAMAGE</font> Crit Damage, <font color='#CA7200'>-%TLMDAMAGE</font> Damage)."
TinySummary="+Crit Damage, -Damage"

[TLMUpgrade_PierceMCrit X2WeaponUpgradeTemplate]
FriendlyName="Advanced Weapon Refinement"
FriendlyNamePlural="Advanced Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMPIERCE</font> Pierce, <font color='#CA7200'>-%TLMCRITDAMAGE/></font> Crit Damage)."
TinySummary="+Pierce, -Crit Damage"

[TLMUpgrade_ShredMDamage X2WeaponUpgradeTemplate]
FriendlyName="Advanced Weapon Refinement"
FriendlyNamePlural="Advanced Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMSHRED</font> Shred, <font color='#CA7200'>-%TLMDAMAGE</font> Damage)."
TinySummary="+Shred, -Damage"

[TLMUpgrade_DamagePlus X2WeaponUpgradeTemplate]
FriendlyName="Superior Weapon Refinement"
FriendlyNamePlural="Superior Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMDAMAGE</font> Damage, <font color='#3ABD23'>+%TLMPIERCE</font> Pierce)."
TinySummary="+Damage, +Pierce"

[TLMUpgrade_CritPlus X2WeaponUpgradeTemplate]
FriendlyName="Superior Weapon Refinement"
FriendlyNamePlural="Superior Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMCRITDAMAGE</font> Crit Damage, <font color='#3ABD23'>+%TLMDAMAGE</font> Damage)."
TinySummary="+Crit Damage, +Damage"

[TLMUpgrade_PiercePlus X2WeaponUpgradeTemplate]
FriendlyName="Superior Weapon Refinement"
FriendlyNamePlural="Superior Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMPIERCE</font> Pierce, <font color='#3ABD23'>+%TLMCRITDAMAGE</font> Crit Damage)."
TinySummary="+Pierce, +Crit Damage"

[TLMUpgrade_ShredPlus X2WeaponUpgradeTemplate]
FriendlyName="Superior Weapon Refinement"
FriendlyNamePlural="Superior Weapon Refinements"
BriefSummary="Some of these weapons seem to have been tuned to improve damage output in different ways (<font color='#3ABD23'>+%TLMSHRED</font> Shred, <font color='#3ABD23'>+%TLMDAMAGE</font> Damage)."
TinySummary="+Shred, +Damage"

[TLMAbility_Damage X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_Crit X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_Pierce X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_Pierce X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_DamageMPierce X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_CritMDamage X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_PierceMCrit X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_ShredMDamage X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_DamagePlus X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_CritPlus X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_PiercePlus X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_ShredPlus X2AbilityTemplate]
LocFriendlyName="Weapon Refinement"

[TLMAbility_RapidFire X2AbilityTemplate]
LocFriendlyName="Rapid Fire"
LocLongDescription="Gain <font color='#3ABD23'><Ability:RapidFireCharges/></font> charges of Rapid Fire ability. Each shot suffers an Aim penalty of <font color='#CA7200'><Ability:RapidFireAimPenalty/></font>. <font color='#3ABD23'><Ability:RapidFireCooldown/></font>-turn cooldown."
LocHelpText="Fire twice in a row at an enemy. Each shot suffers an Aim penalty of <font color='#CA7200'><Ability:RapidFireAimPenalty/></font>."
LocFlyOverText="Rapid Fire"
LocPromotionPopupText="<Bullet/> Rapid Fire is a devastating ability for dealing ranged damage.<br/>"

[TLMAbility_HailOfBullets X2AbilityTemplate]
LocFriendlyName="Hail of Bullets"
LocLongDescription="Gain <font color='#3ABD23'><Ability:HailOfBulletsCharges/></font> charges of Hail of Bullets ability. Unleash a hail of bullets that is guaranteed to hit your target, but uses a lot of ammunition. <font color='#3ABD23'><Ability:HailOfBulletsCooldown/></font>-turn cooldown."
LocHelpText="Unleash a hail of bullets that is guaranteed to hit your target, but uses a lot of ammunition."
LocFlyOverText="Hail of Bullets"
LocPromotionPopupText="<Bullet/> Hail of Bullets requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[TLMAbility_KillZone X2AbilityTemplate]
LocFriendlyName="Kill Zone"
LocLongDescription="Gain <font color='#3ABD23'><Ability:KillZoneCharges/></font> charges of Kill Zone ability. Take a reaction shot against any enemy that moves or attacks within a cone of fire. <font color='#3ABD23'><Ability:KillZoneCooldown/></font>-turn cooldown."
LocHelpText="Take a reaction shot against any enemy that moves or attacks within a cone of fire."
LocFlyOverText="Kill Zone"
LocPromotionPopupText="<Bullet/> There is no limit to the amount of Kill Zone shots a <Ability:ClassName/> can take outside of ammo counts.<br/><Bullet/> Kill Zone utilizes Squadsight, even if the <Ability:ClassName/> does not have the Long Watch ability.<br/><Bullet/> Kill Zone has a <Ability:SelfCooldown/> turn cooldown.<br/>"
LocFriendlyNameWhenConcealed="Kill Zone (Concealed)"

[TLMAbility_Faceoff X2AbilityTemplate]
LocFriendlyName="Faceoff"
LocLongDescription="Gain <font color='#3ABD23'><Ability:FaceoffCharges/></font> charges of Faceoff ability. Fire once at every visible enemy with your pistol. <font color='#3ABD23'><Ability:FaceoffCooldown/></font>-turn cooldown."
LocHelpText="Fire once at every visible enemy with your pistol."
LocFlyOverText="Faceoff"
LocPromotionPopupText="<Bullet/> Faceoff is best augmented by aggressive field positioning, granting a high chance to hit at multiple targets.<br/><Bullet/> Faceoff has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[TLMAbility_AdventSoldierKiller X2AbilityTemplate]
LocFriendlyName="Advent Killer"
LocLongDescription="This weapon echoes the death of millions killed by the Advent occupation. +<font color='#3ABD23'><Ability:BonusDamageAdventSoldier/></font> damage to Advent soldiers."
LocHelpText="Deal more damage to Advent soldiers."
LocFlyOverText="Faceoff"